#Задача №3828. Четные индексы
a=input().split()
for x in range(0,len(a),2):
    print(a[x])